assigment_two/hw2_rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show()
    id = params[:id] # retrieve movie ID from URI route
#    @movie = Movie.find(:all, :order => "title ASK")
    @movie = Movie.find(id) # look up movie by unique ID

SELECT "movies".* FROM "movies" ORDER BY release_date ASC
---
  def index
     @all_ratings = ["G", "PG", "PG-13", "R"]
    # # @title_class = "unselect"
    # # @date_class = "unselect"
    # if params[:sort] == "title"
    #   @movies = Movie.order("title ASC")
    #   # session[:sort] = "title"
    #   # @title_class = "hilite"
    #   # @date_class = "unselect"
    # else if params[:sort] == "date"
    #        @movies = Movie.order("release_date ASC")
    #        # session[:sort] = "date"
    #        # @title_class = "unselect"
    #        # @date_class = "hilite"
    #      else
    #        @movie = Movie.all
    #        # session.clear
    #        # @title_class = "unselect"
    #        # @date_class = "unselect"
    #      end
    # end
       @movie = Movie.all